In [59]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [60]:
names = pd.Series(['Nada', 'Jumanah', 'Reema'], index=(1, 2, 3))
names

1       Nada
2    Jumanah
3      Reema
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [61]:
names.index = [12, 13, 14]
names

12       Nada
13    Jumanah
14      Reema
dtype: object

## Q3: Retrieve First and second elements.

In [62]:
names.head(2)

12       Nada
13    Jumanah
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [63]:
n4 = pd.Series({14: 'Reema'})
names = names.append(n4)
names

/var/folders/51/y33zc8z51kz_hn9r7926m77r0000gn/T/ipykernel_1686/4153043907.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  names = names.append(n4)

12       Nada
13    Jumanah
14      Reema
14      Reema
dtype: object

In [64]:
names = names.drop_duplicates()
names

12       Nada
13    Jumanah
14      Reema
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [65]:
student_data = {'ID': [439200898, 430200999, 439696787],
        'Name': ['Nada', 'Jumanah', 'Reema']}
student = pd.DataFrame(student_data)
student

          ID     Name
0  439200898     Nada
1  430200999  Jumanah
2  439696787    Reema

## Q6: Read educ_figdp_1_Data.csv file

In [66]:
df = pd.read_csv('educ_figdp_1_Data.csv')
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [69]:
new_series = pd.Series(['Nada', 'Jumanah', 'Reema'], index=['IT', 'CS', 'IS'])
new_series

IT       Nada
CS    Jumanah
IS      Reema
dtype: object

In [75]:
new_series.loc['CS']

'Jumanah'

In [72]:
new_series.iloc[1]

'Jumanah'